﻿﻿﻿﻿﻿﻿﻿﻿//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2018, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************

/** @file FastBoot.uni
 *  FastBoot Setup strings definitions.
 */
 
/=#
#include "VFR.uni"

#ifndef x-AMI
#langdef   x-AMI "x-AMI"    // AMI Configuration Language
#endif

#string STR_FAST_BOOT                   #language eng "Fast Boot"
                                        #language x-AMI "PTT000"
#string STR_FAST_BOOT_HELP              #language eng "Enables or disables boot with initialization of a minimal set of devices required to launch active boot option. Has no effect for BBS boot options."
#string STR_FAST_BOOT_BANNER_ONE        #language eng "WARNING!!! WARNING!!! WARNING!!!"
#string STR_FAST_BOOT_BANNER_TWO        #language eng "You are about enabling FAST BOOT!" 
#string STR_FAST_BOOT_BANNER_THREE      #language eng "Please refer to user manual about" 
#string STR_FAST_BOOT_BANNER_FOUR       #language eng "additional requirements"

#string STR_FB_SATA                     #language eng " SATA Support"
                                        #language x-AMI "PTT001"
#string STR_FB_SATA_HELP                #language eng "If Last Boot SATA Devices Only, Only last boot SATA device will be available in Post. If All SATA Devices, all SATA devices will be available in OS and Post."
                                        
#string STR_FB_USB                      #language eng " USB Support"
                                        #language x-AMI "PTT002"
#string STR_FB_USB_HELP                 #language eng "If Disabled, all USB devices will NOT be available until after OS boot. If Partial Initial, USB Mass Storage and specific USB port/device will NOT be available before OS boot. If Enabled, all USB devices will be available in OS and Post."
                                        
#string STR_FB_PS2                      #language eng " PS2 Devices Support"
                                        #language x-AMI "PTT003"
#string STR_FB_PS2_HELP                 #language eng "If Disabled, PS2 devices will be skipped."

#string STR_FB_VGA                      #language eng " VGA Support"
                                        #language x-AMI "PTT004"
#string STR_FB_VGA_HELP                 #language eng "If Auto, only install Legacy OpRom with Legacy OS and logo would NOT be shown during post. Efi driver will still be installed with EFI OS."
                                        
#string STR_FB_NETWORK_STACK            #language eng " Network Stack Driver Support"
                                        #language x-AMI "PTT005"
#string STR_FB_NETWORK_STACK_HELP       #language eng "If Disabled, NetWork Stack Driver will be skipped."

#string STR_FB_NVME                     #language eng " NVMe Support"
                                        #language x-AMI "PTT006"
#string STR_FB_NVME_HELP                #language eng "If Disabled, NVMe device will be skipped."

#string STR_ENABLE                      #language eng "Enabled"
                                        #language x-AMI "PTT007"
#string STR_DISABLE                     #language eng "Disabled"
                                        #language x-AMI "PTT008"
#string STR_FULL_INIT                   #language eng "Full Initial"
                                        #language x-AMI "PTT009"
#string STR_PATIAL_INIT                 #language eng "Partial Initial"
                                        #language x-AMI "PTT00A"
#string STR_VGA_DRIVER                  #language eng "EFI Driver"
                                        #language x-AMI "PTT00B"
#string STR_AUTO                        #language eng "Auto"
                                        #language x-AMI "PTT00C"
#string STR_SATA_HDD_ONLY               #language eng "HDD Only"
                                        #language x-AMI "PTT00D"
#string STR_SATA_ALL                    #language eng "All SATA Devices"
                                        #language x-AMI "PTT00E"
#string STR_SATA_LAST_BOOT_ONLY         #language eng "Last Boot SATA Devices Only"
                                        #language x-AMI "PTT00F"
#string STR_FB_REDIRECTION              #language eng "Redirection Support"
                                        #language x-AMI "PTT010"
#string STR_FB_REDIRECTION_HELP         #language eng "If disable, Redirection function will be disabled."
                                        #language x-AMI "PTT011"
#string STR_NVME                        #language eng "NVMe Devices"
                                        #language x-AMI "PTT012"                                        
                                        
//*************************************************************************
//*************************************************************************
//**                                                                     **
//**        (C)Copyright 1985-2018, American Megatrends, Inc.            **
//**                                                                     **
//**                       All Rights Reserved.                          **
//**                                                                     **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093           **
//**                                                                     **
//**                       Phone: (770)-246-8600                         **
//**                                                                     **
//*************************************************************************
//*************************************************************************
